cases/DM_radialflow_4cells/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         cellLimited Gauss linear 1;  //Gauss linear;
    //grad(U)         cellLimited Gauss linear 1;  //Gauss linear;
}

divSchemes
{
    //default          Gauss linear;                     //Options: Gauss linearUpwind grad(U) //bounded Gauss upwind; //Gauss QUICK;  //bounded Gauss vanLeer;
    div(rhoPhi,U)    Gauss linearUpwind grad(U);         //momentum equation: second order upwinding
    div(phi,alpha1_) Gauss vanLeer;                      //volume fraction equation: van Leer limiter
    div(phi)         Gauss vanLeer;
    div(phi,p_rgh)   Gauss vanLeer;
    div(phiHbyA)     bounded Gauss upwind;               //pressure equation: first order upwinding
    div(phi,rgh_)    bounded Gauss upwind; 
    div(phi_)        bounded Gauss upwind; 
    div(interpolate(U),alpha1_) Gauss vanLeer;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(U)           Gauss linear; 
    div(phi,alpha)   Gauss vanLeer;
    div(phirb,alpha) Gauss linear;
    div(interpolate((rho*U)),U) bounded Gauss upwind;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}




// ************************************************************************* //
