cases/DM_radialflow_4cells/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.resin 0
);

regions
(
    cylinderToCell
    {
        action      new;
        p1	   (0 0 -1);
        p2         (0 0 1);
        radius      0.007;


        fieldValues
        (
            volScalarFieldValue alpha.resin 1
        );
    }
);


// ************************************************************************* //
